
## Plan Result (aat)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.app_insights_connection_string
  * module.application_insights.azurerm_monitor_activity_log_alert.main
* Replace
  * module.application_insights.azurerm_application_insights.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app_insights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_connection_string" {
        id                      = "https://probate-aat.vault.azure.net/secrets/app-insights-connection-string/9f823a2759d34bd08f44fb945d49743e"
        name                    = "app-insights-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_application_insights.this must be replaced
-/+ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "bfbe37f4-8a09-4bcb-ac87-ce11b4ee5e56" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/probate-cron-ccd-data-migration-tool-aat/providers/Microsoft.Insights/components/probate-cron-ccd-data-migration-tool-appinsights-aat" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ location                              = "westeurope" -> "uksouth" # forces replacement
        name                                  = "probate-cron-ccd-data-migration-tool-appinsights-aat"
        tags                                  = {
            "application"         = "probate"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/probate-ccd-data-migration-tool.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#probate"
            "environment"         = "staging"
            "managedBy"           = "Probate"
        }
        # (12 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main will be updated in-place
  ~ resource "azurerm_monitor_activity_log_alert" "main" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/probate-cron-ccd-data-migration-tool-aat/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - probate-cron-ccd-data-migration-tool-appinsights-aat"
        name                = "Application Insights daily cap reached - probate-cron-ccd-data-migration-tool-appinsights-aat"
      ~ scopes              = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/probate-cron-ccd-data-migration-tool-aat/providers/Microsoft.Insights/components/probate-cron-ccd-data-migration-tool-appinsights-aat",
        ] -> (known after apply)
        tags                = {
            "application"         = "probate"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/probate-ccd-data-migration-tool.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#probate"
            "environment"         = "staging"
            "managedBy"           = "Probate"
        }
        # (3 unchanged attributes hidden)

      ~ criteria {
          ~ resource_id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/probate-cron-ccd-data-migration-tool-aat/providers/Microsoft.Insights/components/probate-cron-ccd-data-migration-tool-appinsights-aat" -> (known after apply)
            # (10 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":19,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->